## Filters

In [1]:
import pandas as pd

In [2]:
data = { 
    '종목코드': ['037730', '036360', '005670'], 
    '종목명': ['3R', '3SOFT', 'ACTS'], 
    '현재가': [1510, 1790, 1185], 
    '등락률': [7.36, 1.65, 1.28] 
}
df_components = pd.DataFrame(data)
df_components

     종목코드    종목명   현재가   등락률
0  037730     3R  1510  7.36
1  036360  3SOFT  1790  1.65
2  005670   ACTS  1185  1.28

In [3]:
df_components = df_components.set_index(keys='종목코드')
df_components

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005670   ACTS  1185  1.28

### row indexing

#### iloc, loc

In [4]:
df_components.index

Index(['037730', '036360', '005670'], dtype='object', name='종목코드')

In [5]:
df_components.columns

Index(['종목명', '현재가', '등락률'], dtype='object')

In [6]:
df_components.iloc[1], type(df_components.iloc[1])

(종목명    3SOFT
 현재가     1790
 등락률     1.65
 Name: 036360, dtype: object,
 pandas.core.series.Series)

In [7]:
df_components.loc['036360'], type(df_components.loc['036360'])

(종목명    3SOFT
 현재가     1790
 등락률     1.65
 Name: 036360, dtype: object,
 pandas.core.series.Series)

In [8]:
df_components.iloc[1:], type(df_components.iloc[1:])

(          종목명   현재가   등락률
 종목코드
 036360  3SOFT  1790  1.65
 005670   ACTS  1185  1.28,
 pandas.core.frame.DataFrame)

In [9]:
df_components.iloc[1:,:2], type(df_components.iloc[1:,:2])

(          종목명   현재가
 종목코드
 036360  3SOFT  1790
 005670   ACTS  1185,
 pandas.core.frame.DataFrame)

In [10]:
df_components.iloc[:,:2]

          종목명   현재가
종목코드
037730     3R  1510
036360  3SOFT  1790
005670   ACTS  1185

In [11]:
df_components.iloc[1:3,:]

          종목명   현재가   등락률
종목코드
036360  3SOFT  1790  1.65
005670   ACTS  1185  1.28

In [12]:
df_components.loc["036360": "005670"] # 행을 중심으로 가져옴

          종목명   현재가   등락률
종목코드
036360  3SOFT  1790  1.65
005670   ACTS  1185  1.28

In [13]:
df_components.loc["036360" : "005670", "현재가" : "등락률"] # 행을 중심으로 가져옴

         현재가   등락률
종목코드
036360  1790  1.65
005670  1185  1.28

#### 명칭 접근 기법

In [14]:
# dataframe 은 행과 열로 구성
df_components.loc[['037730', '005670']]

         종목명   현재가   등락률
종목코드
037730    3R  1510  7.36
005670  ACTS  1185  1.28

In [15]:
df_components.loc[['037730', '005670'], ['종목명', '등락률']]

         종목명   등락률
종목코드
037730    3R  7.36
005670  ACTS  1.28

#### condition use

In [16]:
df_components.loc[df_components.loc[:,"현재가"] <= 1700]

         종목명   현재가   등락률
종목코드
037730    3R  1510  7.36
005670  ACTS  1185  1.28

In [17]:
condition = df_components.loc[:,"현재가"] <= 1700
condition

종목코드
037730     True
036360    False
005670     True
Name: 현재가, dtype: bool

In [18]:
df_components.loc[condition,['종목명', '등락률']]

         종목명   등락률
종목코드
037730    3R  7.36
005670  ACTS  1.28

In [19]:
df_components[condition,['종목명', '등락률']] # 부정

InvalidIndexError: (종목코드
037730     True
036360    False
005670     True
Name: 현재가, dtype: bool, ['종목명', '등락률'])

#### merge (concatenate) numpy
- stack(), concat()

In [21]:
import numpy as np

In [27]:
merge_array_first = np.array([[1,2],[3,4]])
merge_array_second = np.array([[5,6],[7,8]])
merge_array_third = np.array([[10,11],[12,13],[14,15]])

In [28]:
merge_array_first.shape, merge_array_second.shape, merge_array_third.shape

((2, 2), (2, 2), (3, 2))

In [30]:
# 행 머지
np.concatenate((merge_array_first,merge_array_third),axis=0)

array([[ 1,  2],
       [ 3,  4],
       [10, 11],
       [12, 13],
       [14, 15]])

In [33]:
# 열 머지
# np.concatenate((merge_array_first,merge_array_third),axis=1) # err 남
np.concatenate((merge_array_first,merge_array_second),axis=1), np.concatenate((merge_array_first,merge_array_second),axis=1).shape

(array([[1, 2, 5, 6],
        [3, 4, 7, 8]]),
 (2, 4))

### merge dataframe

### 묻지마 방식

In [36]:
data = {
    '종가': [113000, 111500],
    '거래량': [555850, 282163]
}

index = ["2019-06-21", "2019-06-20"]
df_first = pd.DataFrame(data=data, index=index)

data = {
    '시가': [112500, 110000],
    '고가': [115000, 112000],
    '저가': [111500, 109000]
}

index = ["2019-06-20", "2019-06-19"]
df_second = pd.DataFrame(data=data, index=index)

### 물어봐 방식

In [39]:
df_first.shape, df_second.shape

((2, 2), (2, 3))

In [47]:
df_first, df_second

(                종가     거래량
 2019-06-21  113000  555850
 2019-06-20  111500  282163,
                 시가      고가      저가
 2019-06-20  112500  115000  111500
 2019-06-19  110000  112000  109000)

In [37]:
pd.concat([df_first,df_second],axis=0)

                  종가       거래량        시가        고가        저가
2019-06-21  113000.0  555850.0       NaN       NaN       NaN
2019-06-20  111500.0  282163.0       NaN       NaN       NaN
2019-06-20       NaN       NaN  112500.0  115000.0  111500.0
2019-06-19       NaN       NaN  110000.0  112000.0  109000.0

In [38]:
# 열 머지
pd.concat([df_first,df_second],axis=1)

                  종가       거래량        시가        고가        저가
2019-06-21  113000.0  555850.0       NaN       NaN       NaN
2019-06-20  111500.0  282163.0  112500.0  115000.0  111500.0
2019-06-19       NaN       NaN  110000.0  112000.0  109000.0

In [44]:
# 열 머지
pd.concat([df_first,df_second],axis=1,join='inner') # index를 기준으로 inner join

                종가     거래량      시가      고가      저가
2019-06-20  111500  282163  112500  115000  111500

In [45]:
# 열 머지
pd.concat([df_first,df_second],axis=1,join='outer') # index를 기준으로 outer join

                  종가       거래량        시가        고가        저가
2019-06-21  113000.0  555850.0       NaN       NaN       NaN
2019-06-20  111500.0  282163.0  112500.0  115000.0  111500.0
2019-06-19       NaN       NaN  110000.0  112000.0  109000.0

In [48]:
# 열 머지
pd.concat([df_second,df_first],axis=1,join='outer') # index를 기준으로 outer join 항상 index가 기준이 되기 때문에 SQL 과는 다르게 outer 순서 상관이 없다

                  시가        고가        저가        종가       거래량
2019-06-20  112500.0  115000.0  111500.0  111500.0  282163.0
2019-06-19  110000.0  112000.0  109000.0       NaN       NaN
2019-06-21       NaN       NaN       NaN  113000.0  555850.0

In [49]:
# 행 머지
pd.concat([df_first,df_second],axis=0,join='outer')

                  종가       거래량        시가        고가        저가
2019-06-21  113000.0  555850.0       NaN       NaN       NaN
2019-06-20  111500.0  282163.0       NaN       NaN       NaN
2019-06-20       NaN       NaN  112500.0  115000.0  111500.0
2019-06-19       NaN       NaN  110000.0  112000.0  109000.0

In [50]:
# 행 머지
pd.concat([df_first,df_second],axis=0,join='inner') # column에 교집합 없어서

Empty DataFrame
Columns: []
Index: [2019-06-21, 2019-06-20, 2019-06-20, 2019-06-19]

#### Merge()
- 특정 컬럼, 특정 행 지정 가능

In [52]:
# 첫 번째 데이터프레임
data = [
    ["전기전자", "005930", "삼성전자", 74400],
    ["화학", "051910", "LG화학", 896000],
    ["전기전자", "000660", "SK하이닉스", 101500]
]

columns = ["업종", "종목코드", "종목명", "현재가"]
df_third = pd.DataFrame(data=data, columns=columns)

# 두 번째 데이터프레임
data = [
    ["은행", 2.92],
    ["보험", 0.37],
    ["화학", 0.06],
    ["전기전자", -2.43]
]

columns = ["업종", "등락률"]
df_fourth = pd.DataFrame(data=data, columns=columns) # 업종을 index 하면 concat 가능

In [53]:
df_third.info(), df_fourth.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   업종      3 non-null      object
 1   종목코드    3 non-null      object
 2   종목명     3 non-null      object
 3   현재가     3 non-null      int64
dtypes: int64(1), object(3)
memory usage: 228.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   업종      4 non-null      object
 1   등락률     4 non-null      float64
dtypes: float64(1), object(1)
memory usage: 196.0+ bytes

(None, None)

In [54]:
df_third, df_fourth

(     업종    종목코드     종목명     현재가
 0  전기전자  005930    삼성전자   74400
 1    화학  051910    LG화학  896000
 2  전기전자  000660  SK하이닉스  101500,
      업종   등락률
 0    은행  2.92
 1    보험  0.37
 2    화학  0.06
 3  전기전자 -2.43)

In [55]:
pd.merge(left=df_third, right=df_fourth, on='업종')

     업종    종목코드     종목명     현재가   등락률
0  전기전자  005930    삼성전자   74400 -2.43
1    화학  051910    LG화학  896000  0.06
2  전기전자  000660  SK하이닉스  101500 -2.43

In [56]:
pd.merge(left=df_fourth, right=df_third, on='업종')

     업종   등락률    종목코드     종목명     현재가
0    화학  0.06  051910    LG화학  896000
1  전기전자 -2.43  005930    삼성전자   74400
2  전기전자 -2.43  000660  SK하이닉스  101500

In [60]:
pd.merge(left=df_third, right=df_fourth, on='업종', how='inner')

     업종    종목코드     종목명     현재가   등락률
0  전기전자  005930    삼성전자   74400 -2.43
1    화학  051910    LG화학  896000  0.06
2  전기전자  000660  SK하이닉스  101500 -2.43

In [59]:
pd.merge(left=df_third, right=df_fourth, on='업종', how='outer')

     업종    종목코드     종목명       현재가   등락률
0    보험     NaN     NaN       NaN  0.37
1    은행     NaN     NaN       NaN  2.92
2  전기전자  005930    삼성전자   74400.0 -2.43
3  전기전자  000660  SK하이닉스  101500.0 -2.43
4    화학  051910    LG화학  896000.0  0.06

In [62]:
pd.merge(left=df_fourth, right=df_third, on='업종', how='outer')

     업종   등락률    종목코드     종목명       현재가
0    보험  0.37     NaN     NaN       NaN
1    은행  2.92     NaN     NaN       NaN
2  전기전자 -2.43  005930    삼성전자   74400.0
3  전기전자 -2.43  000660  SK하이닉스  101500.0
4    화학  0.06  051910    LG화학  896000.0

### group by

In [63]:
data = [
    ["2차전지(생산)", "SK이노베이션", 10.19, 1.29],
    ["해운", "팬오션", 21.23, 0.95],
    ["시스템반도체", "티엘아이", 35.97, 1.12],
    ["해운", "HMM", 21.52, 3.20],
    ["시스템반도체", "아이에이", 37.32, 3.55],
    ["2차전지(생산)", "LG화학", 83.06, 3.75]
]

columns = ["테마", "종목명", "PER", "PBR"]
df_stock = pd.DataFrame(data=data, columns=columns)
df_stock

         테마      종목명    PER   PBR
0  2차전지(생산)  SK이노베이션  10.19  1.29
1        해운      팬오션  21.23  0.95
2    시스템반도체     티엘아이  35.97  1.12
3        해운      HMM  21.52  3.20
4    시스템반도체     아이에이  37.32  3.55
5  2차전지(생산)     LG화학  83.06  3.75

#### like conditions

In [65]:
df_stock[df_stock["테마"]=="2차전지(생산)"] # 이거 반복

         테마      종목명    PER   PBR
0  2차전지(생산)  SK이노베이션  10.19  1.29
5  2차전지(생산)     LG화학  83.06  3.75

In [66]:
df_conditions_first = df_stock[df_stock["테마"]=="2차전지(생산)"] 
df_conditions_first["PER"].mean()

46.625

#### group by

In [67]:
df_stock.groupby(by="테마").get_group("2차전지(생산)")

         테마      종목명    PER   PBR
0  2차전지(생산)  SK이노베이션  10.19  1.29
5  2차전지(생산)     LG화학  83.06  3.75

In [68]:
df_stock.groupby(by="테마").get_group("해운")

   테마  종목명    PER   PBR
1  해운  팬오션  21.23  0.95
3  해운  HMM  21.52  3.20

In [70]:
df_stock.groupby(by="테마")["PER"]

In [71]:
df_stock.groupby(by="테마")["PER"].mean()

테마
2차전지(생산)    46.625
시스템반도체      36.645
해운          21.375
Name: PER, dtype: float64

In [74]:
df_stock.groupby(by="테마")[["PER","PBR"]].mean()

             PER    PBR
테마
2차전지(생산)  46.625  2.520
시스템반도체    36.645  2.335
해운        21.375  2.075

#### group by with agg()

In [75]:

df_stock.groupby(by="테마").agg({"PER":max,"PBR":min})

/tmp/ipykernel_51285/909672753.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df_stock.groupby(by="테마").agg({"PER":max,"PBR":min})
/tmp/ipykernel_51285/909672753.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df_stock.groupby(by="테마").agg({"PER":max,"PBR":min})

            PER   PBR
테마
2차전지(생산)  83.06  1.29
시스템반도체    37.32  1.12
해운        21.52  0.95

In [77]:
df_stock.groupby(by="테마").agg({"PER":[max,sum],"PBR":[min,max]})

/tmp/ipykernel_51285/497982809.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df_stock.groupby(by="테마").agg({"PER":[max,sum],"PBR":[min,max]})
/tmp/ipykernel_51285/497982809.py:1: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df_stock.groupby(by="테마").agg({"PER":[max,sum],"PBR":[min,max]})
/tmp/ipykernel_51285/497982809.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df_stock.groupby(by="테마").agg({"PER":[max,sum],"PBR":[min,max]})
/tmp/ipykernel_51285/497982809.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df_stock.groupby(by="테마").agg({"PER":[max,sum],"PBR":[min,max]})

            PER          PBR
            max    sum   min   max
테마
2차전지(생산)  83.06  93.25  1.29  3.75
시스템반도체    37.32  73.29  1.12  3.55
해운        21.52  42.75  0.95  3.20